In [1]:
import libraries as ls

In [2]:
animals = ls.DataFrame(ls.np.arange(16).reshape(4, 4),
                       columns = ['W', 'X', 'Y','Z'],
                       index = ['Dog', 'Cat', 'Bird', 'Mouse'])

In [3]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [8]:
animals.iloc[1:2,animals.columns.get_indexer(['W', 'Y'])] = ls.np.nan ## through 1 and  2 , W and Y column set the value null

In [9]:
animals

          W   X     Y   Z
Dog     0.0   1   2.0   3
Cat     NaN   5   NaN   7
Bird    8.0   9  10.0  11
Mouse  12.0  13  14.0  15